3344jok/stm32project/prj/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "dma.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_2.8_lcd.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
// 宏定义IO口开关
#define GPIO_OUT1_ON HAL_GPIO_WritePin(UL_GPIO_Port,UL_Pin,GPIO_PIN_SET)
#define GPIO_OUT1_OFF HAL_GPIO_WritePin(UL_GPIO_Port,UL_Pin,GPIO_PIN_RESET)
#define GPIO_OUT2_ON HAL_GPIO_WritePin(VL_GPIO_Port,UL_Pin,GPIO_PIN_SET)
#define GPIO_OUT2_OFF HAL_GPIO_WritePin(VL_GPIO_Port,UL_Pin,GPIO_PIN_RESET)
#define GPIO_OUT3_ON HAL_GPIO_WritePin(UL_GPIO_Port,WL_Pin,GPIO_PIN_SET)
#define GPIO_OUT3_OFF HAL_GPIO_WritePin(UL_GPIO_Port,WL_Pin,GPIO_PIN_RESET)
#define TIM8_CH1_ON HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_1)
#define TIM8_CH1_OFF HAL_TIM_PWM_Stop(&htim8,TIM_CHANNEL_1)
#define TIM8_CH2_ON HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_2)
#define TIM8_CH2_OFF HAL_TIM_PWM_Stop(&htim8,TIM_CHANNEL_2)
#define TIM8_CH3_ON HAL_TIM_PWM_Start(&htim8,TIM_CHANNEL_3)
#define TIM8_CH3_OFF HAL_TIM_PWM_Stop(&htim8,TIM_CHANNEL_3)
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
// 计数变量
static int timcnt, timcnt1, hallcnt;
// 霍尔状态
static int hall_a, hall_b, hall_c;
// ADC数据
uint16_t AdcBuf1 = 0;	// 母线
uint16_t AdcBuf3 = 0; // 电位器
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
// PWM控制
void PWM_Ctl(int hall_a,int hall_b,int hall_c);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_ADC3_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM8_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
	// LCD初始化
	STM32_LCD_Init();
	LCD_Clear(BackColor);
	LCD_SetTextColor(Blue);
	// 关闭DMA中断
	HAL_NVIC_DisableIRQ(DMA2_Stream0_IRQn);
	HAL_NVIC_DisableIRQ(DMA2_Stream1_IRQn);
	// 开启ADC-DMA
	HAL_ADC_Start(&hadc1);
	HAL_ADC_Start_DMA(&hadc1,(uint32_t*) &AdcBuf1,1);
	HAL_ADC_Start(&hadc3);
	HAL_ADC_Start_DMA(&hadc3,(uint32_t*) &AdcBuf3,1);
	// 使能TIM3中断
	HAL_TIM_Base_Start_IT(&htim3);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	// 数据初始化
	uint8_t stflag = 0;	// 运行标志位
	double speed = 0;		// 转速
	double duty_cycle = 0;	// 占空比
	uint16_t PwmCP = 0;		//定时器PWM比较值
  while (1)
  {
		if(!HAL_GPIO_ReadPin(KEY_SEL_GPIO_Port,KEY_SEL_Pin))
		{
			if(!stflag)
			{
				// 开启TIM2中断和TIM8刹车中断
				HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_1);
				HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_2);
				HAL_TIM_IC_Start_IT(&htim2,TIM_CHANNEL_3);
				__HAL_TIM_ENABLE_IT(&htim8, TIM_IT_BREAK);
				// TIM2换相上电
				HAL_TIM_IC_CaptureCallback(&htim2);
				HAL_Delay(4);
				HAL_TIM_IC_CaptureCallback(&htim2);
				stflag = 1;
			}
			if(timcnt>=10)// 10ms
			{
				speed=(double)hallcnt/0.01/6/4;// rps
				hallcnt=0;
				HAL_ADC_Start_DMA(&hadc3,(uint32_t*) &AdcBuf3,1);
				PwmCP=AdcBuf3;
				__HAL_TIM_SetCompare(&htim8,TIM_CHANNEL_1,PwmCP);
				__HAL_TIM_SetCompare(&htim8,TIM_CHANNEL_2,PwmCP);
				__HAL_TIM_SetCompare(&htim8,TIM_CHANNEL_3,PwmCP);
				timcnt=0;
			}
			if(timcnt1>=500)// 500ms
			{
				HAL_ADC_Start_DMA(&hadc1,(uint32_t*) &AdcBuf1,1);
				duty_cycle=(double)PwmCP*100/8401;
				LCD_DisplayStringLine(0,(uint8_t *)"Ptm");
				LCD_DisplayStringLine(2,(uint8_t *)"DutyCircle");
				LCD_DisplayStringLine(4,(uint8_t *)"CurSpeed");
				LCD_DisplayStringLine(6,(uint8_t *)"BusVol");
				LCD_Draw_NUM(0,150,AdcBuf3);
				LCD_Draw_NUM(50,150,duty_cycle);
				LCD_Draw_NUM(100,150,speed);
				LCD_Draw_NUM(150,150,AdcBuf1);
				timcnt1 = 0;
			}
		}
		else
		{
			// 关闭所有输出
			LCD_Clear(BackColor);
			LCD_SetTextColor(Blue);
			TIM8_CH1_OFF;TIM8_CH2_OFF;TIM8_CH3_OFF;
			GPIO_OUT1_OFF;GPIO_OUT2_OFF; GPIO_OUT3_OFF;
			__HAL_TIM_DISABLE_IT(&htim8, TIM_IT_BREAK);
			HAL_TIM_IC_Stop_IT(&htim2,TIM_CHANNEL_1);
			HAL_TIM_IC_Stop_IT(&htim2,TIM_CHANNEL_2);
			HAL_TIM_IC_Stop_IT(&htim2,TIM_CHANNEL_3);
			stflag=0;
		}
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 168;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void PWM_Ctl(int hall_a,int hall_b,int hall_c)
{
	//关闭输出
	TIM8_CH1_OFF; TIM8_CH2_OFF; TIM8_CH3_OFF;
	GPIO_OUT1_OFF; GPIO_OUT2_OFF; GPIO_OUT3_OFF;
	//根据霍尔状态改变PWM输出
	if(hall_a==1 && hall_b==0 && hall_c==1)
	{
		TIM8_CH1_ON;
		GPIO_OUT2_ON;
	}
	else if(hall_a==1 && hall_b==0 && hall_c==0)
	{
		TIM8_CH1_ON;
		GPIO_OUT3_ON;
	}
	else if(hall_a==1 && hall_b==1 && hall_c==0)
	{
		TIM8_CH2_ON;
		GPIO_OUT3_ON;
	}
	else if(hall_a==0 && hall_b==1 && hall_c==0)
	{
		TIM8_CH2_ON;
		GPIO_OUT1_ON;
	}
	else if(hall_a==0 && hall_b==1 && hall_c==1)
	{
		TIM8_CH3_ON;
		GPIO_OUT1_ON;
	}
	else if(hall_a==0 && hall_b==0 && hall_c==1)
	{
		TIM8_CH3_ON;
		GPIO_OUT2_ON;
	}
}

// TIM3回调函数
void HAL_TIM_PeriodElapsedCallback (TIM_HandleTypeDef *htim)
{
	if(htim->Instance == TIM3)
	{
		timcnt++;
		timcnt1++;
	}
}

// 输入捕获回调
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
	if(htim->Instance == TIM2)
	{
		hall_a=HAL_GPIO_ReadPin(GPIOA,GPIO_PIN_15);
		hall_b=HAL_GPIO_ReadPin(GPIOB,GPIO_PIN_3);
		hall_c=HAL_GPIO_ReadPin(GPIOB,GPIO_PIN_10);
		PWM_Ctl(hall_a,hall_b,hall_c);
		hallcnt++;
	}
}

// 刹车
void HAL_TIMEx_BreakCallback(TIM_HandleTypeDef *htim)
{
	if(htim->Instance == TIM8)
	{
		TIM8_CH1_OFF; TIM8_CH2_OFF; TIM8_CH3_OFF;
		GPIO_OUT1_OFF; GPIO_OUT2_OFF; GPIO_OUT3_OFF;
		__HAL_TIM_DISABLE_IT(&htim8, TIM_IT_BREAK);
	}
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
